Output from `terraform plan`
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.glue_job_shared_custom_log4j_properties will be updated in-place
  ~ resource "aws_s3_object" "glue_job_shared_custom_log4j_properties" {
      ~ etag                   = "0cc99243fc06af5acced374d55cedadf" -> "a16f83edfb0b801002a664e77e242b9a"
        id                     = "logging/ingestion-jobs/log4j2.properties"
        tags                   = {}
      + version_id             = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.reconciliation-jobs["activities"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-activities-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-activities-preproduction"
        }
    }

  # module.reconciliation-jobs["activity-sch"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-activity-sch-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-activity-sch-preproduction"
        }
    }

  # module.reconciliation-jobs["adjudications"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-adjudications-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-adjudications-preproduction"
        }
    }

  # module.reconciliation-jobs["case-notes"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-case-notes-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-case-notes-preproduction"
        }
    }

  # module.reconciliation-jobs["caseloads"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-caseloads-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-caseloads-preproduction"
        }
    }

  # module.reconciliation-jobs["cases"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-cases-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-cases-preproduction"
        }
    }

  # module.reconciliation-jobs["dps-activities"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-dps-activities-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-dps-activities-preproduction"
        }
    }

  # module.reconciliation-jobs["establishments"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-establishments-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-establishments-preproduction"
        }
    }

  # module.reconciliation-jobs["finance"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-finance-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-finance-preproduction"
        }
    }

  # module.reconciliation-jobs["gangs"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-gangs-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-gangs-preproduction"
        }
    }

  # module.reconciliation-jobs["hdc"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-hdc-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-hdc-preproduction"
        }
    }

  # module.reconciliation-jobs["incidents"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-incidents-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-incidents-preproduction"
        }
    }

  # module.reconciliation-jobs["movements"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-movements-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-movements-preproduction"
        }
    }

  # module.reconciliation-jobs["non-associations"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-non-associations-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-non-associations-preproduction"
        }
    }

  # module.reconciliation-jobs["orders"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-orders-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-orders-preproduction"
        }
    }

  # module.reconciliation-jobs["person"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-person-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-person-preproduction"
        }
    }

  # module.reconciliation-jobs["prisoner"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-prisoner-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-prisoner-preproduction"
        }
    }

  # module.reconciliation-jobs["prisoner-address"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-prisoner-address-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-prisoner-address-preproduction"
        }
    }

  # module.reconciliation-jobs["prisoner-ed"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-prisoner-ed-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-prisoner-ed-preproduction"
        }
    }

  # module.reconciliation-jobs["prisoner-health"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-prisoner-health-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-prisoner-health-preproduction"
        }
    }

  # module.reconciliation-jobs["prisoner-profile"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-prisoner-profile-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-prisoner-profile-preproduction"
        }
    }

  # module.reconciliation-jobs["questionnaire"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-questionnaire-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-questionnaire-preproduction"
        }
    }

  # module.reconciliation-jobs["reference"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-reference-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-reference-preproduction"
        }
    }

  # module.reconciliation-jobs["safety"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-safety-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-safety-preproduction"
        }
    }

  # module.reconciliation-jobs["sentence"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-sentence-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-sentence-preproduction"
        }
    }

  # module.reconciliation-jobs["transactions"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-transactions-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-transactions-preproduction"
        }
    }

  # module.reconciliation-jobs["visits"].aws_glue_trigger.glue_file_archive_job_trigger[0] will be created
  + resource "aws_glue_trigger" "glue_file_archive_job_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "dpr-reconciliation-visits-preproduction-trigger"
      + schedule = "cron(05 11 4 OCT ? 2024)"
      + state    = (known after apply)
      + tags_all = (known after apply)
      + type     = "SCHEDULED"

      + actions {
          + job_name = "dpr-reconciliation-visits-preproduction"
        }
    }

Plan: 27 to add, 1 to change, 0 to destroy.

```